#! Module 1
# 1. Простые числа
# Найди все простые числа в диапазоне от 2 до 1000.

# 2. Частота символов в строке
# Пользователь вводит строку. Создай словарь, где:

# ключ — символ строки,
# значение — количество его вхождений.
# 3. Объединение словарей
# Создай два словаря и объедини их в один.

# 4. Удаление ключа из словаря
# Удалить ключ из словаря по введённому пользователем значению ключа.

# * Module 2

# . Уникальные слова
# Подсчитать количество уникальных слов в предложении. Сохранить их в словарь.

# 6. Группировка слов по длине
# Принимается список слов. Вернуть словарь, где ключ — длина слова, а значение — список слов этой длины.

# 7. Удаление по первой букве
# Удалить из словаря все элементы, ключи которых начинаются с определённого символа.

# 8. Книги: самый ранний год
# Список словарей с данными о трёх книгах (автор, название, год). Вывести книгу с самым ранним годом издания.

# 9. Самый-самый по параметру
# Список словарей: имя, рост, возраст, вес. Пользователь выбирает параметр, программа находит имя с максимумом по этому параметру.

# 10. Самый дешёвый товар
# Словарь: магазин → список товаров. Найти самый дешёвый товар среди всех.

# 11. Самая маленькая страна
# Словарь: страна → {население, площадь}. Найти страну с наименьшей площадью.

# 12. Уникальные символы строки
# Вывести все уникальные символы в строке.

# 13. Уникальные слова по алфавиту
# Найти все уникальные слова в тексте и вывести их по алфавиту.
